a python lib(module)....manipulate data in ML

behaves like xL file

dataframe----

In [46]:
import pandas as pd

In [47]:
iris=pd.read_csv("iris.csv")          #read_json , read_xl , read html

In [48]:
iris

     5.1  3.5  1.4   .2     Setosa
0    4.9  3.0  1.4  0.2     Setosa
1    4.7  3.2  1.3  0.2     Setosa
2    4.6  3.1  1.5  0.2     Setosa
3    5.0  3.6  1.4  0.2     Setosa
4    5.4  3.9  1.7  0.4     Setosa
..   ...  ...  ...  ...        ...
144  6.7  3.0  5.2  2.3  Virginica
145  6.3  2.5  5.0  1.9  Virginica
146  6.5  3.0  5.2  2.0  Virginica
147  6.2  3.4  5.4  2.3  Virginica
148  5.9  3.0  5.1  1.8  Virginica

[149 rows x 5 columns]

In [49]:
print(type(iris))

<class 'pandas.core.frame.DataFrame'>

In [50]:
#df=iris   #any change happen in any refereneone reflect in both as both will contain 

df=iris.copy()   #a new memory spce will be created (now both have diff ref)

In [51]:
df.head()

   5.1  3.5  1.4   .2  Setosa
0  4.9  3.0  1.4  0.2  Setosa
1  4.7  3.2  1.3  0.2  Setosa
2  4.6  3.1  1.5  0.2  Setosa
3  5.0  3.6  1.4  0.2  Setosa
4  5.4  3.9  1.7  0.4  Setosa

In [52]:
df.head(3)

   5.1  3.5  1.4   .2  Setosa
0  4.9  3.0  1.4  0.2  Setosa
1  4.7  3.2  1.3  0.2  Setosa
2  4.6  3.1  1.5  0.2  Setosa

In [53]:
df.tail()

     5.1  3.5  1.4   .2     Setosa
144  6.7  3.0  5.2  2.3  Virginica
145  6.3  2.5  5.0  1.9  Virginica
146  6.5  3.0  5.2  2.0  Virginica
147  6.2  3.4  5.4  2.3  Virginica
148  5.9  3.0  5.1  1.8  Virginica

In [54]:
df.tail(6)

     5.1  3.5  1.4   .2     Setosa
143  6.7  3.3  5.7  2.5  Virginica
144  6.7  3.0  5.2  2.3  Virginica
145  6.3  2.5  5.0  1.9  Virginica
146  6.5  3.0  5.2  2.0  Virginica
147  6.2  3.4  5.4  2.3  Virginica
148  5.9  3.0  5.1  1.8  Virginica

In [55]:
df.columns   #print column header

Index(['5.1', '3.5', '1.4', '.2', 'Setosa'], dtype='object')

In [56]:
df.index #print labels

RangeIndex(start=0, stop=149, step=1)

In [57]:
#changing column headers

df.columns=["sl","sw","pl",'pw','flower_type']

In [58]:
df.head()

    sl   sw   pl   pw flower_type
0  4.9  3.0  1.4  0.2      Setosa
1  4.7  3.2  1.3  0.2      Setosa
2  4.6  3.1  1.5  0.2      Setosa
3  5.0  3.6  1.4  0.2      Setosa
4  5.4  3.9  1.7  0.4      Setosa

In [59]:
df.shape

(149, 5)

In [60]:
df.dtypes

sl             float64
sw             float64
pl             float64
pw             float64
flower_type     object
dtype: object

In [61]:
df.describe()

               sl          sw          pl          pw
count  149.000000  149.000000  149.000000  149.000000
mean     5.848322    3.054362    3.773826    1.206040
std      0.828594    0.435810    1.760543    0.760354
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.400000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

they all not consider NaN

25 percentile----what is the value for which 25% of the total values comes under it

here 25percentile_score = 5.1 means 25% values are less than it

eg if 25%_score=0
      50%_score=0
      75%_score=0
      100%_score=1   this tells most of data is 0

In [62]:
#accesing particular column

df.sl #or df['sl']

0      4.9
1      4.7
2      4.6
3      5.0
4      5.4
      ...
144    6.7
145    6.3
146    6.5
147    6.2
148    5.9
Name: sl, Length: 149, dtype: float64

In [63]:
df.isnull()

        sl     sw     pl     pw  flower_type
0    False  False  False  False        False
1    False  False  False  False        False
2    False  False  False  False        False
3    False  False  False  False        False
4    False  False  False  False        False
..     ...    ...    ...    ...          ...
144  False  False  False  False        False
145  False  False  False  False        False
146  False  False  False  False        False
147  False  False  False  False        False
148  False  False  False  False        False

[149 rows x 5 columns]

In [64]:
df.isnull().sum()  #column wise no of null values

sl             0
sw             0
pl             0
pw             0
flower_type    0
dtype: int64

In [65]:
#taking slice of data

#df[1:4,2:4]-----give error
df.iloc[1:4,2:4]

    pl   pw
1  1.3  0.2
2  1.5  0.2
3  1.4  0.2

In [66]:
df.head()

    sl   sw   pl   pw flower_type
0  4.9  3.0  1.4  0.2      Setosa
1  4.7  3.2  1.3  0.2      Setosa
2  4.6  3.1  1.5  0.2      Setosa
3  5.0  3.6  1.4  0.2      Setosa
4  5.4  3.9  1.7  0.4      Setosa

lebels= 0 1 2 3 4

In [67]:
df.drop(0)  #del 0 lebel row

      sl   sw   pl   pw flower_type
1    4.7  3.2  1.3  0.2      Setosa
2    4.6  3.1  1.5  0.2      Setosa
3    5.0  3.6  1.4  0.2      Setosa
4    5.4  3.9  1.7  0.4      Setosa
5    4.6  3.4  1.4  0.3      Setosa
..   ...  ...  ...  ...         ...
144  6.7  3.0  5.2  2.3   Virginica
145  6.3  2.5  5.0  1.9   Virginica
146  6.5  3.0  5.2  2.0   Virginica
147  6.2  3.4  5.4  2.3   Virginica
148  5.9  3.0  5.1  1.8   Virginica

[148 rows x 5 columns]

In [70]:
df.drop(4,inplace=True)

In [73]:
a=df.drop(0) ##makes copy of df in a by excluding 0 th row
a.head()

    sl   sw   pl   pw flower_type
2  4.6  3.1  1.5  0.2      Setosa
3  5.0  3.6  1.4  0.2      Setosa
5  4.6  3.4  1.4  0.3      Setosa
6  5.0  3.4  1.5  0.2      Setosa
7  4.4  2.9  1.4  0.2      Setosa

In [74]:
df.head()

    sl   sw   pl   pw flower_type
0  4.9  3.0  1.4  0.2      Setosa
2  4.6  3.1  1.5  0.2      Setosa
3  5.0  3.6  1.4  0.2      Setosa
5  4.6  3.4  1.4  0.3      Setosa
6  5.0  3.4  1.5  0.2      Setosa

label vs position
drop work with labels

In [75]:
df.index  # print all labels

Int64Index([  0,   2,   3,   5,   6,   7,   8,   9,  10,  11,
            ...
            139, 140, 141, 142, 143, 144, 145, 146, 147, 148],
           dtype='int64', length=147)

In [76]:
#return labels of position......df.index[position]
df.index[0],df.index[4]

(0, 6)

In [78]:
#drop by position
df.drop(df.index[0]) #drop at 0th position 

#below is the output of returned value not after droping

      sl   sw   pl   pw flower_type
2    4.6  3.1  1.5  0.2      Setosa
3    5.0  3.6  1.4  0.2      Setosa
5    4.6  3.4  1.4  0.3      Setosa
6    5.0  3.4  1.5  0.2      Setosa
7    4.4  2.9  1.4  0.2      Setosa
..   ...  ...  ...  ...         ...
144  6.7  3.0  5.2  2.3   Virginica
145  6.3  2.5  5.0  1.9   Virginica
146  6.5  3.0  5.2  2.0   Virginica
147  6.2  3.4  5.4  2.3   Virginica
148  5.9  3.0  5.1  1.8   Virginica

[146 rows x 5 columns]

In [79]:
df.head()

    sl   sw   pl   pw flower_type
0  4.9  3.0  1.4  0.2      Setosa
2  4.6  3.1  1.5  0.2      Setosa
3  5.0  3.6  1.4  0.2      Setosa
5  4.6  3.4  1.4  0.3      Setosa
6  5.0  3.4  1.5  0.2      Setosa

In [80]:
df.drop(df.index[0],inplace=True)

In [81]:
df.head()

    sl   sw   pl   pw flower_type
2  4.6  3.1  1.5  0.2      Setosa
3  5.0  3.6  1.4  0.2      Setosa
5  4.6  3.4  1.4  0.3      Setosa
6  5.0  3.4  1.5  0.2      Setosa
7  4.4  2.9  1.4  0.2      Setosa

In [82]:
df.drop(df.index[0],inplace=True)
df.head()

    sl   sw   pl   pw flower_type
3  5.0  3.6  1.4  0.2      Setosa
5  4.6  3.4  1.4  0.3      Setosa
6  5.0  3.4  1.5  0.2      Setosa
7  4.4  2.9  1.4  0.2      Setosa
8  4.9  3.1  1.5  0.1      Setosa

In [84]:
#droping at multiple positions

df.drop(df.index[[0,3]],inplace=True)  #del at position 0 and 3 (not from 0 to 3)
df.head()

     sl   sw   pl   pw flower_type
5   4.6  3.4  1.4  0.3      Setosa
6   5.0  3.4  1.5  0.2      Setosa
8   4.9  3.1  1.5  0.1      Setosa
9   5.4  3.7  1.5  0.2      Setosa
10  4.8  3.4  1.6  0.2      Setosa

In [87]:
df.drop(df.index[[0,1,2,3]],inplace=True)  #drop from osition 0 1 2 3
df.head()

     sl   sw   pl   pw flower_type
10  4.8  3.4  1.6  0.2      Setosa
11  4.8  3.0  1.4  0.1      Setosa
12  4.3  3.0  1.1  0.1      Setosa
13  5.8  4.0  1.2  0.2      Setosa
14  5.7  4.4  1.5  0.4      Setosa

In [88]:
df.sl>5  #checking conditions across row

10     False
11     False
12     False
13      True
14      True
       ...
144     True
145     True
146     True
147     True
148     True
Name: sl, Length: 139, dtype: bool

In [89]:
df[df.sl>5] #return rows satisfying condition like boolean arr

      sl   sw   pl   pw flower_type
13   5.8  4.0  1.2  0.2      Setosa
14   5.7  4.4  1.5  0.4      Setosa
15   5.4  3.9  1.3  0.4      Setosa
16   5.1  3.5  1.4  0.3      Setosa
17   5.7  3.8  1.7  0.3      Setosa
..   ...  ...  ...  ...         ...
144  6.7  3.0  5.2  2.3   Virginica
145  6.3  2.5  5.0  1.9   Virginica
146  6.5  3.0  5.2  2.0   Virginica
147  6.2  3.4  5.4  2.3   Virginica
148  5.9  3.0  5.1  1.8   Virginica

[115 rows x 5 columns]

In [90]:
df[df.flower_type=="Setosa"].describe()

              sl         sw         pl         pw
count  39.000000  39.000000  39.000000  39.000000
mean    5.033333   3.451282   1.464103   0.253846
std     0.360068   0.395948   0.189858   0.112029
min     4.300000   2.300000   1.000000   0.100000
25%     4.800000   3.200000   1.350000   0.200000
50%     5.000000   3.400000   1.500000   0.200000
75%     5.200000   3.700000   1.600000   0.300000
max     5.800000   4.400000   1.900000   0.600000

In [98]:

# iloc and head work by position
print(df.head())
print(df.iloc[0:5])
#print(df.loc[0])   #work by label---give error as 0 label is deleted
print(df.loc[10]) 
print(df.loc[10:12])  #here last is included

     sl   sw   pl   pw flower_type
10  4.8  3.4  1.6  0.2      Setosa
11  4.8  3.0  1.4  0.1      Setosa
12  4.3  3.0  1.1  0.1      Setosa
13  5.8  4.0  1.2  0.2      Setosa
14  5.7  4.4  1.5  0.4      Setosa
     sl   sw   pl   pw flower_type
10  4.8  3.4  1.6  0.2      Setosa
11  4.8  3.0  1.4  0.1      Setosa
12  4.3  3.0  1.1  0.1      Setosa
13  5.8  4.0  1.2  0.2      Setosa
14  5.7  4.4  1.5  0.4      Setosa
sl                4.8
sw                3.4
pl                1.6
pw                0.2
flower_type    Setosa
Name: 10, dtype: object
     sl   sw   pl   pw flower_type
10  4.8  3.4  1.6  0.2      Setosa
11  4.8  3.0  1.4  0.1      Setosa
12  4.3  3.0  1.1  0.1      Setosa

In [99]:
# add a row
df.loc[0]=[1,2,3,4,"Setosa"]  #add at end with 0 label

In [100]:
df.tail()

      sl   sw   pl   pw flower_type
145  6.3  2.5  5.0  1.9   Virginica
146  6.5  3.0  5.2  2.0   Virginica
147  6.2  3.4  5.4  2.3   Virginica
148  5.9  3.0  5.1  1.8   Virginica
0    1.0  2.0  3.0  4.0      Setosa

In [101]:
df.loc[149]=[1,2,3,4,"Setosa"]
df.tail()

      sl   sw   pl   pw flower_type
146  6.5  3.0  5.2  2.0   Virginica
147  6.2  3.4  5.4  2.3   Virginica
148  5.9  3.0  5.1  1.8   Virginica
0    1.0  2.0  3.0  4.0      Setosa
149  1.0  2.0  3.0  4.0      Setosa

In [104]:
#reset the index
df.reset_index(drop=True,inplace=True)

In [105]:
df.index

RangeIndex(start=0, stop=141, step=1)

In [107]:
df.reset_index() #without drop=True a new column index will created
#below is tell what it will return, not the current condition of df

     index   sl   sw   pl   pw flower_type
0        0  4.8  3.4  1.6  0.2      Setosa
1        1  4.8  3.0  1.4  0.1      Setosa
2        2  4.3  3.0  1.1  0.1      Setosa
3        3  5.8  4.0  1.2  0.2      Setosa
4        4  5.7  4.4  1.5  0.4      Setosa
..     ...  ...  ...  ...  ...         ...
136    136  6.5  3.0  5.2  2.0   Virginica
137    137  6.2  3.4  5.4  2.3   Virginica
138    138  5.9  3.0  5.1  1.8   Virginica
139    139  1.0  2.0  3.0  4.0      Setosa
140    140  1.0  2.0  3.0  4.0      Setosa

[141 rows x 6 columns]

In [108]:
df.head()

    sl   sw   pl   pw flower_type
0  4.8  3.4  1.6  0.2      Setosa
1  4.8  3.0  1.4  0.1      Setosa
2  4.3  3.0  1.1  0.1      Setosa
3  5.8  4.0  1.2  0.2      Setosa
4  5.7  4.4  1.5  0.4      Setosa

In [110]:
#how to delete column
df.drop('sl',axis=1)  #axis=1 means column  "sl"---tells which label to delete

      sw   pl   pw flower_type
0    3.4  1.6  0.2      Setosa
1    3.0  1.4  0.1      Setosa
2    3.0  1.1  0.1      Setosa
3    4.0  1.2  0.2      Setosa
4    4.4  1.5  0.4      Setosa
..   ...  ...  ...         ...
136  3.0  5.2  2.0   Virginica
137  3.4  5.4  2.3   Virginica
138  3.0  5.1  1.8   Virginica
139  2.0  3.0  4.0      Setosa
140  2.0  3.0  4.0      Setosa

[141 rows x 4 columns]

In [111]:
df.head()

    sl   sw   pl   pw flower_type
0  4.8  3.4  1.6  0.2      Setosa
1  4.8  3.0  1.4  0.1      Setosa
2  4.3  3.0  1.1  0.1      Setosa
3  5.8  4.0  1.2  0.2      Setosa
4  5.7  4.4  1.5  0.4      Setosa

In [113]:
df.drop('sl',axis=1,inplace=True)
df.head()

    sw   pl   pw flower_type
0  3.4  1.6  0.2      Setosa
1  3.0  1.4  0.1      Setosa
2  3.0  1.1  0.1      Setosa
3  4.0  1.2  0.2      Setosa
4  4.4  1.5  0.4      Setosa

In [114]:
# another way to del a column

del df['sw']

In [115]:
df.head()

    pl   pw flower_type
0  1.6  0.2      Setosa
1  1.4  0.1      Setosa
2  1.1  0.1      Setosa
3  1.2  0.2      Setosa
4  1.5  0.4      Setosa

In [117]:
#re copying the data
df=iris.copy()
df.columns=["sl","sw","pl",'pw','flower_type']
df.head()

    sl   sw   pl   pw flower_type
0  4.9  3.0  1.4  0.2      Setosa
1  4.7  3.2  1.3  0.2      Setosa
2  4.6  3.1  1.5  0.2      Setosa
3  5.0  3.6  1.4  0.2      Setosa
4  5.4  3.9  1.7  0.4      Setosa

In [118]:
#adding a column

df["dif_pl_pw"]=df['pl']-df['pw']  #works directy at original df
df.tail()

      sl   sw   pl   pw flower_type  dif_pl_pw
144  6.7  3.0  5.2  2.3   Virginica        2.9
145  6.3  2.5  5.0  1.9   Virginica        3.1
146  6.5  3.0  5.2  2.0   Virginica        3.2
147  6.2  3.4  5.4  2.3   Virginica        3.1
148  5.9  3.0  5.1  1.8   Virginica        3.3

In [119]:
df["abc"]=1

In [120]:
df.head()

    sl   sw   pl   pw flower_type  dif_pl_pw  abc
0  4.9  3.0  1.4  0.2      Setosa        1.2    1
1  4.7  3.2  1.3  0.2      Setosa        1.1    1
2  4.6  3.1  1.5  0.2      Setosa        1.3    1
3  5.0  3.6  1.4  0.2      Setosa        1.2    1
4  5.4  3.9  1.7  0.4      Setosa        1.3    1

# Handling NaN

2 options

remove entire row
replace vaues with mean,median,etc based on conditin

In [121]:
df

      sl   sw   pl   pw flower_type  dif_pl_pw  abc
0    4.9  3.0  1.4  0.2      Setosa        1.2    1
1    4.7  3.2  1.3  0.2      Setosa        1.1    1
2    4.6  3.1  1.5  0.2      Setosa        1.3    1
3    5.0  3.6  1.4  0.2      Setosa        1.2    1
4    5.4  3.9  1.7  0.4      Setosa        1.3    1
..   ...  ...  ...  ...         ...        ...  ...
144  6.7  3.0  5.2  2.3   Virginica        2.9    1
145  6.3  2.5  5.0  1.9   Virginica        3.1    1
146  6.5  3.0  5.2  2.0   Virginica        3.2    1
147  6.2  3.4  5.4  2.3   Virginica        3.1    1
148  5.9  3.0  5.1  1.8   Virginica        3.3    1

[149 rows x 7 columns]

In [122]:
#to make specific entries 0

df.iloc[2:4,1:3]=0

In [123]:
df.head()

    sl   sw   pl   pw flower_type  dif_pl_pw  abc
0  4.9  3.0  1.4  0.2      Setosa        1.2    1
1  4.7  3.2  1.3  0.2      Setosa        1.1    1
2  4.6  0.0  0.0  0.2      Setosa        1.3    1
3  5.0  0.0  0.0  0.2      Setosa        1.2    1
4  5.4  3.9  1.7  0.4      Setosa        1.3    1

In [124]:
#to make specific entries NaN we need numpy
import numpy as np

df.iloc[2:4,1:3]=np.NaN

In [125]:
df.head()

    sl   sw   pl   pw flower_type  dif_pl_pw  abc
0  4.9  3.0  1.4  0.2      Setosa        1.2    1
1  4.7  3.2  1.3  0.2      Setosa        1.1    1
2  4.6  NaN  NaN  0.2      Setosa        1.3    1
3  5.0  NaN  NaN  0.2      Setosa        1.2    1
4  5.4  3.9  1.7  0.4      Setosa        1.3    1

In [127]:
df.describe()

               sl         sw          pl          pw   dif_pl_pw    abc
count  149.000000  147.00000  147.000000  149.000000  149.000000  149.0
mean     5.848322    3.05034    3.805442    1.206040    2.567785    1.0
std      0.828594    0.43642    1.751273    0.760354    1.049277    0.0
min      4.300000    2.00000    1.000000    0.100000    0.800000    1.0
25%      5.100000    2.80000    1.600000    0.300000    1.300000    1.0
50%      5.800000    3.00000    4.400000    1.300000    2.900000    1.0
75%      6.400000    3.30000    5.100000    1.800000    3.300000    1.0
max      7.900000    4.40000    6.900000    2.500000    4.700000    1.0

In [129]:
#handling NaN by droping row

df.dropna(inplace=True)

In [130]:
df.head()

    sl   sw   pl   pw flower_type  dif_pl_pw  abc
0  4.9  3.0  1.4  0.2      Setosa        1.2    1
1  4.7  3.2  1.3  0.2      Setosa        1.1    1
4  5.4  3.9  1.7  0.4      Setosa        1.3    1
5  4.6  3.4  1.4  0.3      Setosa        1.1    1
6  5.0  3.4  1.5  0.2      Setosa        1.3    1

In [131]:
df.reset_index(drop=True,inplace=True)  
df.iloc[2:4,1:3]=np.NaN   #creating nan again after reseting index

In [132]:
df.head()

    sl   sw   pl   pw flower_type  dif_pl_pw  abc
0  4.9  3.0  1.4  0.2      Setosa        1.2    1
1  4.7  3.2  1.3  0.2      Setosa        1.1    1
2  5.4  NaN  NaN  0.4      Setosa        1.3    1
3  4.6  NaN  NaN  0.3      Setosa        1.1    1
4  5.0  3.4  1.5  0.2      Setosa        1.3    1

In [133]:
#handling nan by replacing with other value

#replacing with mean
df.sw.fillna(df.sw.mean(),inplace=True)
df.head()

    sl        sw   pl   pw flower_type  dif_pl_pw  abc
0  4.9  3.000000  1.4  0.2      Setosa        1.2    1
1  4.7  3.200000  1.3  0.2      Setosa        1.1    1
2  5.4  3.042069  NaN  0.4      Setosa        1.3    1
3  4.6  3.042069  NaN  0.3      Setosa        1.1    1
4  5.0  3.400000  1.5  0.2      Setosa        1.3    1

In [134]:
df.pl.fillna(df.pl.mean(),inplace=True)
df.head()

    sl        sw        pl   pw flower_type  dif_pl_pw  abc
0  4.9  3.000000  1.400000  0.2      Setosa        1.2    1
1  4.7  3.200000  1.300000  0.2      Setosa        1.1    1
2  5.4  3.042069  3.836552  0.4      Setosa        1.3    1
3  4.6  3.042069  3.836552  0.3      Setosa        1.1    1
4  5.0  3.400000  1.500000  0.2      Setosa        1.3    1

In [135]:
#df.pl.fillna(df[df.flower_type=="Setosa"].pl.mean())

# Handling strings

we need to convert strings to numeric to perform calculation

In [136]:
df["Gender"]="Female"

In [137]:
df.head()

    sl        sw        pl   pw flower_type  dif_pl_pw  abc  Gender
0  4.9  3.000000  1.400000  0.2      Setosa        1.2    1  Female
1  4.7  3.200000  1.300000  0.2      Setosa        1.1    1  Female
2  5.4  3.042069  3.836552  0.4      Setosa        1.3    1  Female
3  4.6  3.042069  3.836552  0.3      Setosa        1.1    1  Female
4  5.0  3.400000  1.500000  0.2      Setosa        1.3    1  Female

In [141]:
df.iloc[0:10,7]="Male"

In [142]:
df.head()

    sl        sw        pl   pw flower_type  dif_pl_pw   abc Gender
0  4.9  3.000000  1.400000  0.2      Setosa        1.2  Male   Male
1  4.7  3.200000  1.300000  0.2      Setosa        1.1  Male   Male
2  5.4  3.042069  3.836552  0.4      Setosa        1.3  Male   Male
3  4.6  3.042069  3.836552  0.3      Setosa        1.1  Male   Male
4  5.0  3.400000  1.500000  0.2      Setosa        1.3  Male   Male

In [143]:
def f(s):
    if s=="Male":
        return 0
    else:
        return 1

df["sex"]=df.Gender.apply(f)
df.head()

    sl        sw        pl   pw flower_type  dif_pl_pw   abc Gender  sex
0  4.9  3.000000  1.400000  0.2      Setosa        1.2  Male   Male    0
1  4.7  3.200000  1.300000  0.2      Setosa        1.1  Male   Male    0
2  5.4  3.042069  3.836552  0.4      Setosa        1.3  Male   Male    0
3  4.6  3.042069  3.836552  0.3      Setosa        1.1  Male   Male    0
4  5.0  3.400000  1.500000  0.2      Setosa        1.3  Male   Male    0

In [144]:
del df["Gender"]
df.head()

    sl        sw        pl   pw flower_type  dif_pl_pw   abc  sex
0  4.9  3.000000  1.400000  0.2      Setosa        1.2  Male    0
1  4.7  3.200000  1.300000  0.2      Setosa        1.1  Male    0
2  5.4  3.042069  3.836552  0.4      Setosa        1.3  Male    0
3  4.6  3.042069  3.836552  0.3      Setosa        1.1  Male    0
4  5.0  3.400000  1.500000  0.2      Setosa        1.3  Male    0